# GetAnalyticalNode Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkIterator..::..GetAnalyticalNode Method
MEPNetworkIterator Class See Also
---
Gets the analytical node at the current iteration step.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public MEPAnalyticalNode GetAnalyticalNode()
```

Visual Basic
---
```text
Public Function GetAnalyticalNode As MEPAnalyticalNode
```

Visual C++
---
```text
public:
MEPAnalyticalNode^ GetAnalyticalNode()
```

# ### Return Value
The retrieved node.
# See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace